app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'pelanggan'
OR `username` = 'pelanggan'
 LIMIT 1
---
    public function processLogin()
    {
        $session = session();
        $model = new UserModel();

        $login = $this->request->getPost('login');
        $password = $this->request->getPost('password');

        // Mencari user berdasarkan email atau username
        $user = $model->where('email', $login)
                      ->orWhere('username', $login)
                      ->first();