app/Controllers/Kuliner.php

SELECT *
FROM `kuliner`
---
    public function index()
    {
        // 1. Proteksi Halaman: Jika belum login, arahkan kembali ke halaman login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $model = new KulinerModel();

        // 2. Mengambil semua data kuliner dari database
        $data['kuliner'] = $model->findAll();