app/Controllers/Pesanan.php

SELECT *
FROM `pesanan`
WHERE `pesanan`.`id` = 3
SELECT *
FROM `pesanan_detail`
WHERE `pesanan_id` = 3
SELECT *
FROM `menus`
WHERE `menus`.`id` = '29'
---
    public function detail(int $pesanan_id)
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $model = new PesananModel();
        $detailModel = new PesananDetailModel();
        $menuModel = new MenuModel();

        $pesanan = $model->find($pesanan_id);

        if (!$pesanan) {
            return redirect()->to('/home')->with('error', 'Pesanan tidak ditemukan.');
        }

        $currentUserId = session()->get('id_user') ?? session()->get('id');
        if ((int) $pesanan['user_id'] !== (int) $currentUserId) {
            return redirect()->to('/home')->with('error', 'Anda tidak memiliki akses ke pesanan ini.');
        }

        // Ambil detail pesanan (3NF) dan join dengan nama menu
        $detailPesanan = $detailModel->where('pesanan_id', $pesanan_id)->findAll();
        foreach ($detailPesanan as &$detail) {
            $menu = $menuModel->find($detail['menu_id']);