app/Models/MenuModel.php

    public function findByNameAndKuliner(string $name, int $kulinerId)
    {
        return $this->where('nama_menu', $name)
            ->where('kuliner_id', $kulinerId)
            ->first();
---
SELECT *
FROM `menus`
WHERE `nama_menu` = 'Aneka Seafood'
AND `kuliner_id` = 16
 LIMIT 1